02-client-server-communications/flatiron-theatre/app/controllers/productions_controller.rb

  def index
    render json: Production.all, status: :ok
---
SELECT "productions".* FROM "productions"

  def show
    render json: Production.find(params[:id]), status: :ok
---
SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    render json: Production.create(production_params), status: :created
---
INSERT INTO "productions" ("title", "genre", "description", "budget", "image", "director", "ongoing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    # render json: Production.find(params[:id]).update(production_params) -> t or f
    production = Production.find(params[:id])
    production.update(production_params)
---
SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "productions" SET "genre" = ?, "updated_at" = ? WHERE "productions"."id" = ?  [["genre", "musical"], ["updated_at", "2023-03-08 00:50:21.214295"], ["id", 6]]

  def destroy
    production = Production.find(params[:id])
    production.destroy
---
SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "productions" WHERE "productions"."id" = ?  [["id", 6]]